package auds.auds10;

import dataStructures.AdjacencyListGraph;

import java.util.Map;
import java.util.Scanner;

/*Дадена е водоводна мрежа во даден град. Во мрежата постои еден извор на вода и поголем број
на крајни корисници. Постојат и неколку дистрибуциски јазли низ кои поминува водата и кои
може да се поврзани преку повеќе патеки. Во самата мрежа можно е да има повеќе патеки низ
кои водата стигнува до крајните корисници.
Мрежата е дадена преку граф од јазли (кои можат да бидат изворот, дистрибуциските јазли или
крајните корисници). Јазлите се поврзани со цевки. Притоа кај секоја од цевките ја има дадено и
нејзина карактеристика- пад на притисок кој се случува доколку водата помине низ неа.
За сите крајни корисници дадена е и надморската висина на која се наоѓаат. Корисниците
добиваат вода доколку разликата од почетниот притисок и вкупната сума на падот на притисокот
по патот до нив е позитивен број. Пример: почетен притисок е 100, водата поминува низ цевки со
пад на притисок од 30, 50 и 10. Корисникот ќе добие вода само доколку се наоѓа на надморска
висина помала од 10 (висина <(100 – (30+50+10))).
Во иницијалната конфигурација на мрежата, сите корисници добиваат вода. Но, во мрежата се
случуваат неколку дефекти, кои го зголемуваат падот на притисокот кај дадени цевки за неколку
пати.
За дадена иницијална мрежа, како и локација и сериозност на дефекти, ваша задача е да ги
испечатите крајните корисници кои нема да добијат вода во таква конфигурација на системот.
Влез: На влез прво е даден броjот на jазли во мрежата N Во
наредните N линии се даени броjот на jазол, па неговата
надморска висина. Изворот е секогаш прв со реден броj 0. Броjот
до изворот е притисокот во мрежата на ниво на изворот.
Дистрибуциските jазли се на надморска висина 0 На краj следат
краjните корисници, до кои после редниот броj е дадена и
нивната надморска висина Потоа следи броjот M, коj го означува
броjот на цевки во мрежата. Во наредните М редови се дадени три
броеви: почетно теме на цевката, краjно теме на цевката и пад на
притисок на таа цевка На краj следи броjот P, коj го означува броjот
на дефекти Во наредните P редици се дадени цевките каj кои има
дефекти, на следен начин: почетно теме на цевката, краjно теме
на цевката и уште еден природен броj, коj кажува колку пати сега е
зголемен падот на притисокот од инициjалниот.
Излез: На излез се печатат броевите на jазлите на краjните
корисници каj кои нема да има вода*/
public class Zadaca4_Vodovod {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        int n = sc.nextInt();
        AdjacencyListGraph<Integer> waterNetwork = new AdjacencyListGraph<>();
        int[] values = new int[n];

        for (int i = 0; i < n; i++) {
            int ind = sc.nextInt();
            int val = sc.nextInt();
            waterNetwork.addVertex(ind);
            values[ind] = val;
        }
        int m = sc.nextInt();
        for (int i = 0; i < m; i++) {
            waterNetwork.addEdge(sc.nextInt(), sc.nextInt(), sc.nextInt());
        }

        int p = sc.nextInt();
        for (int i = 0; i < p; i++) {
            int startVertex = sc.nextInt();
            int endVertex = sc.nextInt();
            int increaseFactor = sc.nextInt();

            int oldWeight = waterNetwork.getWeight(startVertex, endVertex);
            int newWeight = oldWeight * increaseFactor;

            waterNetwork.addEdge(startVertex, endVertex, newWeight);
        }
        sc.close();

        Map<Integer, Integer> shortestPaths = waterNetwork.shortestPath(0);

        for (int i = 1; i < n; i++) {
            if (values[i] != 0) {
                if (values[0] - (shortestPaths.get(i) + values[i]) <= 0) {
                    System.out.println(i + " ");
                }
            }
        }
    }
}
