package dadeniVezbi.vezbi;

import java.util.Scanner;

/*На автобуската станица во ФинТаун имало N возрасни и M деца кои што сакале да патуваат заедно за соседниот град МинТаун.
Цената на еден билет е 100 денари. Ако некој возрасен сака да патува со k деца, треба да плати еден билет за него и k-1 билети за децата
(за едно дете не мора да плаќа билет). Исто така, возрасен може да се вози и сам, во тој случај ќе си плати еден билет за него.
Дополнително знаеме дека децата не можат да се возат без да се придружени од некој возрасен. Во првиот ред од влезот е даден бројот N.
Во вториот ред е даден бројот M. Потребно е да пресметате колкав е минималниот и максималниот број на денари што може да ги платат
патниците за билети и да ги испечатите во две линии. Во автобусот ќе има најмалку еден возрасен.
 */
public class Avtobus {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        int n = sc.nextInt();
        int m = sc.nextInt();

        int minDen = 0;
        int maxDen = 0;

        if (n >= m) {
            maxDen = (n * 100) + ((m - 1) * 100);
            minDen = n * 100;
        } else {
            maxDen = (n * 100) + ((m - 1) * 100);
            minDen = (n * 100) + ((m - n) * 100);
        }

        System.out.println(minDen);
        System.out.println(maxDen);
    }
}
