package dynamicProgramming.book;

import java.util.*;

/*
Шахистите се специфични луѓе, па сакаат се да им е поврзано со
шахот. Затоа тие бараат нивните телефонски броеви на нумеричката
тастатура на телефон (Слика 2. 3.) да може да се притискаат следејќи
го движењето на фигурата коњ. Попрецизно, после секоја притисната
цифра на тастатурата, тие сакаат следната цифра на бројот да биде на
копче на кое би можела да скокне фигурата коњ (две полиња во еден
правец и едно нормално на тој правец). Да се најде колку вкупно
такви 𝑛-цифрени броеви постојат!
*/
public class _2_5_TelefoniSahisti {

    public static void main(String[] args) {
        Scanner scn = new Scanner(System.in);
        int n = scn.nextInt();


        int[][] A = new int[n + 1][10];

        for (int k = 0; k <= 9; k++)
            A[1][k] = 1;

        for (int i = 2; i <= n; i++) {
            A[i][0] = A[i - 1][4] + A[i - 1][6];
            A[i][1] = A[i - 1][6] + A[i - 1][8];
            A[i][2] = A[i - 1][7] + A[i - 1][9];
            A[i][3] = A[i - 1][4] + A[i - 1][8];
            A[i][4] = A[i - 1][0] + A[i - 1][3] + A[i - 1][9];
            A[i][5] = 0;
            A[i][6] = A[i - 1][0] + A[i - 1][1] + A[i - 1][7];
            A[i][7] = A[i - 1][2] + A[i - 1][6];
            A[i][8] = A[i - 1][1] + A[i - 1][3];
            A[i][9] = A[i - 1][2] + A[i - 1][4];
        }

        int B = 0;

        for (int k = 0; k <= 9; k++)
            B = B + A[n][k];

        System.out.println(B);
    }

}
