package dynamicProgramming.book;

import java.util.Scanner;

/*
Еден професор учествува на конференција на која има паралелни
предавања. Во програмата на конференцијата е дадено кое
предавање кога почнува и кога завршува. Професорот си обележал
кои предавања го интересираат, но увидел дека не може да стигне
да ги посети сите. Тој не сака да влегува на веќе почнато предавање,
ниту пак да излезе од предавањето пред тоа да заврши. Затоа решил
да го пресмета најголемиот број на предавања на кои може да
присуствува. Предавањата се одвиваат во простории кои се доволно
близу едно до друго, па професорот не троши време за
преместување од една во друга просторија. Во општ случај овој
проблем може да се јави во различна форма, но основата е да се
распоредат одреден број на активности кои бараат некој ист ресурс,
како што е овде професорот, што значи дека може да се прави само
една активност во дадено време и имаат иста цел, да се најде
максимално множество на активности кои се меѓусебно не се
поклопуваат, како овде предавањата. Ваквите активности, кои не се
преклопуваат се нарекуваат меѓусебно компатибилни. Нека
претпоставиме дека имаме 𝑛 дадени предавања 𝑥𝑖, 𝑖 = 1, 𝑛̅̅̅̅̅ и секое
предавање 𝑥𝑖 има време кога почнува 𝑠𝑖 и време кога завршува 𝑓𝑖 ,
каде 0 ≤ 0 ≤ 𝑠𝑖 < 𝑓𝑖 < ∞. Секое предавање 𝑥𝑖 се одвива во текот на
интервалот [𝑠𝑖, 𝑓𝑖) . За две предавања 𝑎𝑖 и 𝑎𝑗 велиме дека се
компатибилни ако интервалите [𝑠𝑖, 𝑓𝑖) и [𝑠𝑗, 𝑓𝑗 ) немаат дел кој се
преклопува. Тогаш ќе важи дека 𝑠𝑖 ≥ 𝑓𝑗 или 𝑠𝑗 ≥ 𝑓𝑖. Во Табела 6. 1 е
дадено множество од 10 предавања кои се интересни за професорот.
Множеството предавања {𝑥1, 𝑥3, 𝑥8, 𝑥10} е компатибилно множество,
но не е најголемото такво, затоа што множеството {𝑥2, 𝑥9, 𝑥6, 𝑥8, 𝑥10}
е поголемо такво множество и воедно најголемото со тоа својство.
*/
public class _6_3_Intervali {
    public static void main(String[] args) {
        Scanner scn = new Scanner(System.in);
        int n = scn.nextInt();
        int[] s = new int[n];
        int[] f = new int[n];

        for (int i = 0; i < n; i++)
            s[i] = scn.nextInt();

        for (int i = 0; i < n; i++)
            f[i] = scn.nextInt();

        System.out.print("1 ");

        int j = 0;
        for (int k = 1; k < n; k++) {
            if (s[k] >= f[j]) {
                System.out.print((k + 1) + " ");
                j = k;
            }
        }
    }

}
