package PrethodniIspitni._2024;

import dataStructures.DLL;
import dataStructures.DLLNode;

import java.util.Scanner;

/*Цик цак листа

Листа од цели броеви помеѓу 1 и 999 е цик цак листа доколку паровите од соседни елементи се наизменично во строго опаѓачки и
строго растечки редослед и првиот пар е во растечки редослед. На пример:
1 <-> 5 <-> 1 <-> 5
1 <-> 12 <-> 2 <-> 15 <-> 10
6 <-> 10 <-> 8 <-> 9 <-> 2 <-> 4 <-> 3
Додека пак следните листи не се цик цак листи:
5 <-> 1 <-> 5 <-> 1
1 <-> 5 <-> 10 <-> 5 <-> 1
5 <-> 10 <-> 7 <-> 5 <-> 7
1 <-> 10 <-> 10 <-> 1
Секоја листа од цели броеви можеме да ја претвориме во цик цак листа.
На пример, во листите
1 <-> 5 <-> 10 <-> 5 <-> 1

првиот пар кој што не прави наизменична промена е парот 5 <-> 10, кој би требало да е во опаѓачки редослед бидејќи пред него има
пар во растечки редослед.
5 <-> 10 <-> 7 <-> 5 <-> 7
првиот пар кој што не прави наизменична промена е парот 7 <-> 5, кој би требало да е во растечки редослед бидејќи пред него има пар
во опаѓачки редослед.
Кога има пар што е во растечки редослед, а треба да е во опаѓачки, како на пример 5 <-> 10, или пар што е во опаѓачки редослед,
а треба да е во растечки, како на пример 7 <-> 5, можеме да го отстраниме јазелот кој што е втор во парот, во овој случај јазлите со
вредност 10 во првиот пар и 5 во вториот пар.
Имплементирајте го методот makeZigZag кој што ќе ја трансформира листата аргумент во цик цак листа.

Влез
Во првиот ред од влезот е даден цел број N, кој го претставува бројот на јазли во листата, а потоа во следниот ред N цели броеви одделени
со празно место помеѓу 1 и 999.

Излез
На излез треба да се испечати променетата листа после нејзината трансформација во цик цак листа.

Пример
Влез:
5
1 5 10 5 1
Излез:
1 <-> 5 <-> 10 <-> 5 <-> 1
1 <-> 5 <-> 1
Појаснување: отстранети се два јазли, тој со вредност 10 бидејќи не е во опаѓачки редослед со претходниот елемент, и тој со вредност 5
после јазелот со вредност 10, повторно бидејќи не е во опаѓачки редослед со претходниот елемент.

Test Input / Output
Input
12
============================
4
1 5 1 5
============================
5
1 12 2 15 10
============================
7
6 10 8 9 2 4 3
============================
4
5 1 5 1
============================
6
5 1 6 1 5 1
============================
6
5 1 5 1 6 1
============================
5
1 5 10 5 1
============================
5
5 10 7 5 7
============================
4
1 10 10 1
============================
1
5
============================
5
10 10 10 10 10
============================
50
1 5 1 1 5 5 1 1 5 5 1 1 5 5 1 5 1 5 1 1 5 1 5 5 5 1 5 5 1 5 5 1 5 1 5 1 1 5 1 5 5 1 5 1 5 1 5 5 1 5
============================

Result
Test case 1
1<->5<->1<->5
1<->5<->1<->5
 
Test case 2
1<->12<->2<->15<->10
1<->12<->2<->15<->10
 
Test case 3
6<->10<->8<->9<->2<->4<->3
6<->10<->8<->9<->2<->4<->3
 
Test case 4
5<->1<->5<->1
5
 
Test case 5
5<->1<->6<->1<->5<->1
5<->6<->1<->5<->1
 
Test case 6
5<->1<->5<->1<->6<->1
5<->6<->1
 
Test case 7
1<->5<->10<->5<->1
1<->5<->1
 
Test case 8
5<->10<->7<->5<->7
5<->10<->7
 
Test case 9
1<->10<->10<->1
1<->10<->1
 
Test case 10
5
5
 
Test case 11
10<->10<->10<->10<->10
10
 
Test case 12
1<->5<->1<->1<->5<->5<->1<->1<->5<->5<->1<->1<->5<->5<->1<->5<->1<->5<->1<->1<->5<->1<->5<->5<->5<->1<->5<->5<->1<->5<->5<->1<->5<->1<->5<->1<->1<->5<->1<->5<->5<->1<->5<->1<->5<->1<->5<->5<->1<->5
1<->5<->1<->5<->1<->5<->1<->5<->1<->5<->1<->5<->1<->5<->1<->5<->1<->5<->1<->5<->1<->5<->1<->5<->1<->5
``*/
public class Septemvri_2024_Vlezna {
    //се користи DLL

    public static void makeZigZag(DLL<Integer> list) {
        DLLNode<Integer> curr = list.getFirst();
        boolean leftIsBigger = false;
        while (curr.getSucc() != null) {
            if (leftIsBigger) {//this means that the current element should be greater than the next one
                if (curr.getElement() <= curr.getSucc().getElement()) {
                    list.delete(curr.getSucc());
                    continue;
                }
            } else {//this means that the current element should be smaller than the next one
                if (curr.getElement() >= curr.getSucc().getElement()) {
                    list.delete(curr.getSucc());
                    continue;
                }
            }
            leftIsBigger = !leftIsBigger;
            curr = curr.getSucc();
        }
    }

    public static void main(String[] args) {
        Scanner input = new Scanner(System.in);
        int tests = input.nextInt();
        input.nextLine();
        for (int t = 1; t <= tests; t++) {
            System.out.println("Test case " + t);
            input.nextLine();
            int n = input.nextInt();
            input.nextLine();

            DLL<Integer> list = new DLL<>();

            for (int i = 0; i < n; i++) {
                list.insertLast(input.nextInt());
            }
            input.nextLine();

            System.out.println(list);

            makeZigZag(list);

            System.out.println(list);

        }

        input.close();
    }
}
